{
  "_commit_hash": null,
  "_name_or_path": "-1-131k-base",
    "architectures": [
      "StripedHyenaModelForCausalLM"
    ],
    "attn_layer_idxs": [
      8,
      16,
      24
    ],
  "padding_idx":0,
  "process_group":null,
  "column_split": false,
  "column_split_hyena": false,
  "eps": 1e-06,
  "final_norm": true,
  "hidden_size": 256,
  "inner_mlp_size": 768,
  "num_attention_heads": 4,
  "num_filters": 256,
  "num_layers": 4,
  "state_size": 4,
  "hyena_filter_groups": 256,
  "hyena_layer_idxs": [
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    25,
    26,
    27,
    28,
    29,
    30,
    31
  ],
  "inference_mode": false,
  "log_intermediate_values": false,
  "make_vocab_size_divisible_by": 8,
  "max_batch_size": 1,
  "max_seqlen": 2048,
  "mha_out_proj_bias": true,
  "mlp_activation": "gelu",
  "model_parallel_size": 1,
  "model_type": "stripedhyena",
  "pipe_parallel_size": 1,
  "prefill_style": "fft",
  "proj_groups": 1,
  "qkv_proj_bias": true,
  "rotary_emb_base": 10000,
  "rotary_emb_scaling_factor": 1,
  "short_filter_bias": true,
  "short_filter_length": 3,
  "smeared_gqa": false,
  "split_k0": false,
  "tie_embeddings": true,
  "torch_dtype": null,
  "transformers_version": null,
  "use_cache": false,
  "use_flash_attn": false,
  "use_flash_depthwise": false,
  "use_flash_rmsnorm": false,
  "use_flashfft": false,
  "use_interpolated_rotary_pos_emb": false,
  "vocab_size": 91,
  "inner_size_multiple_of":64,
  "attn_block_dtype": null,
  "mlp_dtype": null,
  "depthwise_dtype": null,
  "long_fir_threshold": null,
  "low_mem_mode":false,
  "hyena_block_dtype": null,
  "compile": false
}
