{
  "metadata": {
    "total_size": 12913164672
  },
  "weight_map": {
    "backbone.blocks.0.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.0.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.1.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.10.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.11.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.12.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.12.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.12.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.12.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.13.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.13.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.14.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.15.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.inner_mha_cls.Wqkv.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.inner_mha_cls.Wqkv.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.inner_mha_cls.out_proj.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.inner_mha_cls.out_proj.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.inner_mha_cls.rotary_emb.inv_freq": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.16.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.17.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.18.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.19.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.2.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.2.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.20.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.20.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.21.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.22.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.filter.D": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.filter.poles": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.filter.residues": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.filter.short_filter_bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.filter.short_filter_weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.mlp.l2.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.mlp.l3.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.out_filter_dense.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.out_filter_dense.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.projections.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.23.projections.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.24.inner_mha_cls.Wqkv.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.24.inner_mha_cls.Wqkv.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.24.inner_mha_cls.out_proj.bias": "model-00002-of-00003.safetensors",
    "backbone.blocks.24.inner_mha_cls.out_proj.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.24.inner_mha_cls.rotary_emb.inv_freq": "model-00002-of-00003.safetensors",
    "backbone.blocks.24.mlp.l1.weight": "model-00002-of-00003.safetensors",
    "backbone.blocks.24.mlp.l2.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.24.mlp.l3.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.24.post_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.24.pre_norm.scale": "model-00002-of-00003.safetensors",
    "backbone.blocks.25.filter.D": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.filter.poles": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.filter.residues": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.filter.short_filter_bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.filter.short_filter_weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.mlp.l1.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.mlp.l2.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.mlp.l3.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.out_filter_dense.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.out_filter_dense.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.post_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.pre_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.projections.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.25.projections.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.filter.D": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.filter.poles": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.filter.residues": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.filter.short_filter_bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.filter.short_filter_weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.mlp.l1.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.mlp.l2.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.mlp.l3.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.out_filter_dense.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.out_filter_dense.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.post_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.pre_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.projections.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.26.projections.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.filter.D": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.filter.poles": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.filter.residues": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.filter.short_filter_bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.filter.short_filter_weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.mlp.l1.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.mlp.l2.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.mlp.l3.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.out_filter_dense.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.out_filter_dense.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.post_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.pre_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.projections.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.27.projections.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.filter.D": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.filter.poles": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.filter.residues": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.filter.short_filter_bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.filter.short_filter_weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.mlp.l1.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.mlp.l2.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.mlp.l3.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.out_filter_dense.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.out_filter_dense.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.post_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.pre_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.projections.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.28.projections.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.filter.D": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.filter.poles": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.filter.residues": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.filter.short_filter_bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.filter.short_filter_weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.mlp.l1.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.mlp.l2.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.mlp.l3.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.out_filter_dense.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.out_filter_dense.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.post_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.pre_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.projections.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.29.projections.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.3.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.3.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.30.filter.D": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.filter.poles": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.filter.residues": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.filter.short_filter_bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.filter.short_filter_weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.mlp.l1.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.mlp.l2.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.mlp.l3.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.out_filter_dense.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.out_filter_dense.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.post_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.pre_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.projections.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.30.projections.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.filter.D": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.filter.poles": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.filter.residues": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.filter.short_filter_bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.filter.short_filter_weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.mlp.l1.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.mlp.l2.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.mlp.l3.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.out_filter_dense.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.out_filter_dense.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.post_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.pre_norm.scale": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.projections.bias": "model-00003-of-00003.safetensors",
    "backbone.blocks.31.projections.weight": "model-00003-of-00003.safetensors",
    "backbone.blocks.4.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.4.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.5.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.6.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.7.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.inner_mha_cls.Wqkv.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.inner_mha_cls.Wqkv.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.inner_mha_cls.out_proj.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.inner_mha_cls.out_proj.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.inner_mha_cls.rotary_emb.inv_freq": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.8.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.filter.D": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.filter.poles": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.filter.residues": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.filter.short_filter_bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.filter.short_filter_weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.mlp.l1.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.mlp.l2.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.mlp.l3.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.out_filter_dense.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.out_filter_dense.weight": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.post_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.pre_norm.scale": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.projections.bias": "model-00001-of-00003.safetensors",
    "backbone.blocks.9.projections.weight": "model-00001-of-00003.safetensors",
    "backbone.embedding_layer.weight": "model-00001-of-00003.safetensors",
    "backbone.norm.scale": "model-00001-of-00003.safetensors"
  }
}
